---
kind: method
id: M:Autodesk.Revit.DB.Electrical.ElectricalDemandFactorValue.#ctor(System.Double,System.Double,System.Double)
source: html/463bc384-ce9b-5b8c-4dd7-cfa72128a147.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalDemandFactorValue.#ctor Method

Constructor. Initializes factor, minimum range and maximum range to values passed in.

## Syntax (C#)
```csharp
public ElectricalDemandFactorValue(
	double minRange,
	double maxRange,
	double factor
)
```

## Parameters
- **minRange** (`System.Double`)
- **maxRange** (`System.Double`)
- **factor** (`System.Double`)